Repository: rb-union/libqapt
Catalog: po/*/qaptbatch.po
Languages: ar

# @label Remaining time
source: Remaining Time:
ar: الوقت المتبقّي:

# @label Download Rate
source: Speed:
ar: السّرعة:

# @info:progress Remaining time
source: Unknown
ar: مجهول

# @info:progress Download rate
source: %1/s
ar: %1/ثا

# @info
source: A batch installer using QApt
ar: مثبّت دفعات يستخدم كيو-آبت

# @title
source: QApt Batch Installer
ar: مثبّت الدّفعات كيو-آبت

# @info:credit
source: Jonathan Thomas
ar: جونَثِن توماس

# @info:credit
source: Harald Sitter
ar: هارالد سِتِر

# @info:credit
source: Qt 5 port
ar: النّقل إلى كيوت 5

# @info:shell
source: Attaches the window to an X app specified by winid
ar: يرفق النّافذة إلى تطبيق س الذي يحدّده معرّف_النّافذة

# @info:shell value name
source: winid
ar: معرّف_النّافذة

# @info:shell
source: Install a package
ar: ثبّت حزمة

# @info:shell
source: Remove a package
ar: أزل حزمة

# @info:shell
source: Update the package cache
ar: حدّث خبيئة الحزم

# @info:shell error
source: Only one operation mode may be defined.
ar: يمكن تحديد وضع عمليّة واحد فقط.

# @info:shell error
source: No operation mode defined.
ar: لا وضع عمليّة محدّد.

# @label
source: Waiting for authorization
ar: ينتظر الاستيثاق

# @label
source: The package system could not be initialized, your configuration may be broken.
ar: تعذّر تمهيد نظام الحزم، قد يكون الضّبط معطوبًا.

# @title:window
source: Initialization error
ar: خطأ تمهيد

# @label
source: The package "%1" has not been found among your software sources. Therefore, it cannot be installed.
ar: لم يُعثر على الحزمة "%1" في مصادر برمجيّاتك. لذلك لا يمكن تثبيتها.

# @title:window
source: Package Not Found
ar: لم يُعثر على الحزمة

# @label
source: Another application seems to be using the package system at this time. You must close all other package managers before you will be able to install or remove any packages.
ar: يبدو أنّ تطبيقًا آخر يستخدم نظام الحزم الآن. عليك إغلاق كلّ مدراء الحزم الأخرى قبل أن تستطيع تثبيت أيّة حزم أو إزالتها.

# @title:window
source: Unable to obtain package system lock
ar: تعذّر الحصول على قفل نظام الحزم

# @label
source: You do not have enough disk space in the directory at %1 to continue with this operation.
ar: لا مساحة قرص كافية لديك في الدّليل %1 لمتابعة هذه العمليّة.

# @title:window
source: Low disk space
ar: مساحة القرص منخفضة

# @label
source: Could not download packages
ar: تعذّر تنزيل الحزم

# @title:window
source: Download failed
ar: فشل التّنزيل

# @label
source: An error occurred while applying changes:
ar: حدث خطأ أثناء تطبيق التّغييرات:

# @title:window
source: Commit error
ar: خطأ إيداع

# @label
source: This operation cannot continue since proper authorization was not provided
ar: لا يمكن متابعة هذه العمليّة حيث لم يُوفَّر الاستيثاق المناسب

# @title:window
source: Authentication error
ar: خطأ استيثاق

# @label
source: It appears that the QApt worker has either crashed or disappeared. Please report a bug to the QApt maintainers
ar: يبدو أنّ عامل (worker) كيو-آبت قد انهار أو اختفى. فضلًا بلّغ عن علّة إلى مصيني كيو-آبت

# @title:window
source: Unexpected Error
ar: خطأ غير متوقّع

# @label
source: The following package has not been verified by its author. Downloading untrusted packages has been disallowed by your current configuration.
ar: تحقّق المؤلّف من الحزمة الآتية. أُلغي السماح بتنزيل الحزم غير الموثوقة حسب ضبطك الحاليّ.

# @title:window
source: Untrusted Packages
ar: حزم غير موثوقة

# @title:window
source: Media Change Required
ar: تغيير الوسيط مطلوب

# @label
source: Please insert %1 into <filename>%2</filename>
ar: فضلًا أدرج %1 إلى <filename>%2</filename>

# @title:window
source: Warning - Unverified Software
ar: تحذير - حزم غير متحقّق منها

# @label
source: The following piece of software cannot be verified. <warning>Installing unverified software represents a security risk, as the presence of unverifiable software can be a sign of tampering.</warning> Do you wish to continue?
ar: تعذّر التّحقّق من قطعة البرمجيّات هذه. <warning>تثبيت برمجيّات غير متحقّق منها يعتبر خطرًا أمنيًّا، إذ أنّ وجود برمجيّات لا يمكن التحقّق منها قد يعتبر علامة على العبث.</warning> أتودّ المتابعة؟

# @label Progress bar label when waiting to start
source: Waiting to start.
ar: ينتظر البدء.

# @label Status label when waiting for a password
source: Waiting for authentication.
ar: ينتظر الاستيثاق.

# @label Status label when waiting for a CD-ROM
source: Waiting for required media.
ar: ينتظر الوسيط المطلوب.

# @label Status label
source: Waiting for other package managers to quit.
ar: ينتظر إنهاء مدراء الحزم الأخرى.

# @label Status label
source: Loading package cache.
ar: يحمّل خبيئة الحزم.

# @title:window
source: Refreshing Package Information
ar: ينعش معلومات الحزمة

# @info:status
source: Checking for new, removed or upgradeable packages
ar: يلتمس الحزم الجديدة، أو المزالة أو القابلة للتّرقية

# @title:window
source: Downloading
ar: ينزّل

# @info:status
source: Downloading package file
ar: لا ينزّل شيء

# @title:window
source: Installing Packages
ar: يثبّت الحزم

# @title:window
source: Installation Complete
ar: اكتمل التّثبيت

# @label
source: Package installation failed.
ar: فشل تثبيت الحزم.

# @label
source: Package successfully installed.
ar: لم يثبّت شيء.

# @title:window
source: Removal Complete
ar: اكتملت الإزالة

# @label
source: Package removal failed.
ar: فشلت إزالة الحزمة.

# @label
source: Package successfully uninstalled.
ar: لم يُزل شيء.

# @title:window
source: Refresh Complete
ar: اكتمل الإنعاش

# @info:status
source: Refresh failed.
ar: فشل الإنعاش

# @label
source: Package information successfully refreshed.
ar: أُنعشت معلومات الحزمة بنجاح.
